In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])
table

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

### 特定Column

In [3]:
table.ID

a    100
b    101
c    102
d    103
e    104
Name: ID, dtype: object

In [4]:
table[['ID', 'City']]

    ID      City
a  100     Tokyo
b  101     Osaka
c  102     Kyoto
d  103  Hokkaido
e  104     Tokyo

In [5]:
col = table.columns
print(col)

table[col[:2]]

Index(['ID', 'City', 'Birth_year', 'Name'], dtype='object')

    ID      City
a  100     Tokyo
b  101     Osaka
c  102     Kyoto
d  103  Hokkaido
e  104     Tokyo

### 特定Row

In [6]:
table.loc[['a', 'b']]

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
b  101  Osaka        1989    Akiki

In [7]:
row = table.index
print(row)

table.loc[row[:2]]

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

    ID   City  Birth_year     Name
a  100  Tokyo        1990  Hiroshi
b  101  Osaka        1989    Akiki

### 轉置

In [8]:
table.T

                  a      b      c         d      e
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiki   Yuki    Satoru  Steve